app/Http/Controllers/AdminController.php

    public function dashboard() {
        $users = DB::table('users')->orderBy('users.created_at', 'desc')
            ->leftJoin('avatars', 'users.id', '=', 'avatars.user_id')
            ->select('users.id', 'users.name','users.email','users.website','users.role', 'avatars.avatar')
            ->take(3)->get();
        $gym_num = DB::table('users')->where('role', '2')->get();
        $tra_num = DB::table('users')->where('role', '3')->get();
        $touri_num = DB::table('touristpasses')->get();
        $memship_num = DB::table('memberships')->get();
---
select `users`.`id`, `users`.`name`, `users`.`email`, `users`.`website`, `users`.`role`, `avatars`.`avatar` from `users` left join `avatars` on `users`.`id` = `avatars`.`user_id` order by `users`.`created_at` desc limit 3
select * from `users` where `role` = '2'
select * from `users` where `role` = '3'
select * from `touristpasses`
select * from `memberships`

    public function users() {
        $users = User::all();
---
select * from `users`

    public function edit($id) {
        $avatar = Avatar::where('user_id', $id)->first();
        $users = User::where('id',$id)->first();
        $company = Company::where('user_id',$id)->first();
        $trainer = Trainer::where('user_id',$id)->first();
        $document = Document::where('user_id',$id)->first();
        $membership = Membership::where('user_id',$id)->get();
        $banner = Banner::where('user_id',$id)->get();
---
select * from `avatars` where `user_id` = '156' limit 1
select * from `users` where `id` = '156' limit 1
select * from `companies` where `user_id` = '156' limit 1
select * from `trainers` where `user_id` = '156' limit 1
select * from `documents` where `user_id` = '156' limit 1
select * from `memberships` where `user_id` = '156'
select * from `banners` where `user_id` = '156'

    public function bank() {
        $users = User::all();
---
select * from `users`

    public function bank_edit($id) {
        $bank = Bbank::where('user_id', $id)->get();
---
select * from `bbanks` where `user_id` = '156'