app/Http/Controllers/PersonalController.php


        sort($countryArray);

        $avatar = Personal_Avatar::where('user_id',auth()->user()->id)->first();
        $company = Trainer::where('user_id',auth()->user()->id)->first();
        $membership = Personal_Membership::where('user_id',auth()->user()->id)->get();
        $document = Document::where('user_id',auth()->user()->id)->first();
---
select * from `personal_avatars` where `user_id` = 282 limit 1
select * from `trainers` where `user_id` = 282 limit 1
select * from `personal__memberships` where `user_id` = 282
select * from `documents` where `user_id` = 282 limit 1

    public function personal_membership_index(){
        //changed by Nemanja
        $membership = Personal_Membership::where('user_id',auth()->user()->id)->get();
---
select * from `personal__memberships` where `user_id` = 164

            'ZW'=>array('name'=>'ZIMBABWE','code'=>'263')
        );

        $data = [

            'youtube' =>  DB::table('brands_social_data')
            ->where('user_id', auth()->user()->id)
            ->where('type','youtube')
            ->get(),

            'certificates' => DB::table('brands_social_data')
            ->where('user_id', auth()->user()->id)
            ->where('type','certificate')
            ->get(),

            'name' => DB::table('brands_social_data')
            ->where('user_id', auth()->user()->id)
            ->where('type','name')
            ->first(),

            'about' => DB::table('brands_info')
            ->where('user_id', auth()->user()->id)
            ->first(),

---
select * from `brands_social_data` where `user_id` = 282 and `type` = 'name' limit 1