app/Http/Controllers/ProfileController.php

    public function index() {
        $data = array('name'=>"Virat Gandhi");

	//$this->send_email( "Login Success ", "Notification" );

        $avatar = Avatar::where('user_id',auth()->user()->id)->first();
        $company = Company::where('user_id',auth()->user()->id)->first();
        $membership = Membership::where('user_id',auth()->user()->id)->get();
        $banner = Banner::where('user_id',auth()->user()->id)->get();
        $document = Document::where('user_id',auth()->user()->id)->first();
---
select * from `avatars` where `user_id` = 156 limit 1
select * from `companies` where `user_id` = 156 limit 1
select * from `memberships` where `user_id` = 156
select * from `banners` where `user_id` = 156
select * from `documents` where `user_id` = 156 limit 1

    public function membership_index(){
        $membership = Membership::where('user_id',auth()->user()->id)->get();
---
select * from `memberships` where `user_id` = 156

    public function avatar(Request $request){

        if(getImageSize($request->avatar)[0] != 512 || getImageSize($request->avatar)[1] != 512)
            return back();
        $imageName = time().'.'.$request->avatar->extension();
        $request->avatar->move(public_path('upload/avatar'), $imageName);
        $path = "upload/avatar/".$imageName;
        $avatar = Avatar::where('user_id',auth()->user()->id)->first();
---
select * from `avatars` where `user_id` = 156 limit 1

    public function touristpass() {
        $touristpass = Touristpass::where('user_id',auth()->user()->id)->get();
---
select * from `touristpasses` where `user_id` = 158

    public function document() {
	$document = Document::where('user_id',auth()->user()->id)->first();
---
select * from `documents` where `user_id` = 158 limit 1

    public function bank(){
        $bank = Bbank::where('user_id', auth()->user()->id)->get();
---
select * from `bbanks` where `user_id` = 158

    public function submit_admin() {
        if (auth()->user()->role == 2) {
            $membership = Membership::where('user_id',auth()->user()->id)->get();
            $touristpass = Touristpass::where('user_id',auth()->user()->id)->get();
            $document = Document::where('user_id',auth()->user()->id)->get();
            $bank = Bbank::where('user_id',auth()->user()->id)->get();
            $company = Company::where('user_id',auth()->user()->id)->get();
---
select * from `memberships` where `user_id` = 158
select * from `touristpasses` where `user_id` = 158
select * from `documents` where `user_id` = 158
select * from `bbanks` where `user_id` = 158
select * from `companies` where `user_id` = 158