app/Providers/AppServiceProvider.php

select * from `avatars` where `user_id` = 60 limit 1
select * from `avatars` where `user_id` = 282 limit 1
---
    public function boot()
    {
        Schema::defaultStringLength(191);
        \View::composer('*', function($view){
            if (auth()->user()) {
                $view->with(['uuid' => auth()->user()->external_id]);
                $avatar = Avatar::where('user_id',auth()->user()->id)->first();
                if ($avatar)
                    $view->with(['avatar_img' => $avatar->avatar]);